In [3]:
import pandas as pd
import sqlite3
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import geopy

In [3]:
#lists tables and indexes in the database
db = sqlite3.connect('data/hop_team.sqlite')

query = "SELECT * FROM sqlite_master; "

master_sqlite = pd.read_sql(query, db)

db.close()

master_sqlite

,type,name,tbl_name,rootpage,sql
0,table,hop_team,hop_team,2,"CREATE TABLE ""hop_team"" (\n""from_npi"" INTEGER,..."
1,table,cbsa,cbsa,2876549,"CREATE TABLE ""cbsa"" (\n""zip"" INTEGER,\n ""cbsa..."
2,table,taxonomy,taxonomy,2877873,"CREATE TABLE ""taxonomy"" (\n""NPI"" INTEGER,\n ""..."
3,table,nucc,nucc,3298774,"CREATE TABLE ""nucc"" (\n""code"" TEXT,\n ""groupi..."
4,index,zip,cbsa,3298917,CREATE INDEX zip ON cbsa(zip)
5,index,NPI,taxonomy,3299319,CREATE INDEX NPI ON taxonomy(NPI)
6,index,code,nucc,3666969,CREATE INDEX code ON nucc(code)
7,table,nppes,nppes,3666974,"CREATE TABLE ""nppes"" (\n""npi"" INTEGER,\n ""ent..."
8,index,nppes_npi,nppes,3810771,CREATE INDEX nppes_npi ON nppes(npi)
9,index,from_npi,hop_team,2131546,CREATE INDEX from_npi ON hop_team(from_npi)
10,index,to_npi,hop_team,3833682,CREATE INDEX to_npi on hop_team(to_npi)

In [9]:
query = '''
SELECT * 
FROM hop_team
LIMIT 5'''
with sqlite3.connect('data/hop_team.sqlite') as db:
    hop_team_5 = pd.read_sql(query,db)
db.close()
hop_team_5.head()

,from_npi,to_npi,patient_count,transaction_count,average_day_wait,std_day_wait
0,1508062167,1730166109,350,370,53.922,72.612
1,1508065640,1730166109,25,25,49.800,55.006
2,1508052093,1730166109,16,16,109.500,70.593
3,1508172545,1730166109,14,14,103.357,75.483
4,1508285131,1730166109,20,21,89.952,89.880

In [10]:
query = '''
SELECT * 
FROM cbsa
LIMIT 5'''
with sqlite3.connect('data/hop_team.sqlite') as db:
    cbsa_5 = pd.read_sql(query,db)

db.close()
cbsa_5.head()

,zip,cbsa,usps_zip_pref_city,usps_zip_pref_state,res_ratio,bus_ratio,oth_ratio,tot_ratio
0,683,41900,SAN GERMAN,PR,0.999842,1.0,1.0,0.999855
1,683,32420,SAN GERMAN,PR,0.000158,0.0,0.0,0.000145
2,923,41980,SAN JUAN,PR,1.000000,1.0,1.0,1.000000
3,1010,44140,BRIMFIELD,MA,0.976896,1.0,1.0,0.977816
4,1010,49340,BRIMFIELD,MA,0.023104,0.0,0.0,0.022184

In [11]:
query = '''
SELECT * 
FROM taxonomy
LIMIT 5'''
with sqlite3.connect('data/hop_team.sqlite') as db:
    taxonomy_5 = pd.read_sql(query,db)

db.close()
taxonomy_5.head()

          NPI taxonomy_switch taxonomy_code
0  1679576722               Y    207X00000X
1  1588667638               Y    207RC0000X
2  1497758544               Y    251G00000X
3  1306849450            None          None
4  1215930367               N    174400000X

In [12]:
query = '''
SELECT * 
FROM nucc
LIMIT 5'''
with sqlite3.connect('data/hop_team.sqlite') as db:
    nucc_5 = pd.read_sql(query,db)

db.close()
nucc_5.head()

,code,grouping,classification,specialization,definition,notes,display_name,section
0,193200000X,Group,Multi-Specialty,None,A business group of one or more individual pra...,[7/1/2003: new],Multi-Specialty Group,Individual
1,193400000X,Group,Single Specialty,None,A business group of one or more individual pra...,[7/1/2003: new],Single Specialty Group,Individual
2,207K00000X,Allopathic & Osteopathic Physicians,Allergy & Immunology,None,An allergist-immunologist is trained in evalua...,"Source: American Board of Medical Specialties,...",Allergy & Immunology Physician,Individual
3,207KA0200X,Allopathic & Osteopathic Physicians,Allergy & Immunology,Allergy,Definition to come...,None,Allergy Physician,Individual
4,207KI0005X,Allopathic & Osteopathic Physicians,Allergy & Immunology,Clinical & Laboratory Immunology,Definition to come...,None,Clinical & Laboratory Immunology (Allergy & Im...,Individual

In [13]:
query = '''
SELECT * 
FROM nppes
LIMIT 5'''
with sqlite3.connect('data/hop_team.sqlite') as db:
    nppes_5 = pd.read_sql(query,db)

db.close()
nppes_5.head()

,npi,entity_type_code,provider_organization_name_(legal_business_name),provider_last_name_(legal_name),provider_first_name,provider_middle_name,provider_name_prefix_text,provider_name_suffix_text,provider_credential_text,provider_first_line_business_practice_location_address,provider_second_line_business_practice_location_address,provider_business_practice_location_address_city_name,provider_business_practice_location_address_state_name,provider_business_practice_location_address_postal_code
0,1679576722,1.0,None,WIEBE,DAVID,A,None,None,M.D.,3500 CENTRAL AVE,None,KEARNEY,NE,688472944.0
1,1588667638,1.0,None,PILCHER,WILLIAM,C,DR.,None,MD,1824 KING STREET,SUITE 300,JACKSONVILLE,FL,322044736.0
2,1497758544,2.0,"CUMBERLAND COUNTY HOSPITAL SYSTEM, INC",None,None,None,None,None,None,3418 VILLAGE DR,None,FAYETTEVILLE,NC,283044552.0
3,1306849450,NaN,None,None,None,None,None,None,None,None,None,None,None,NaN
4,1215930367,1.0,None,GRESSOT,LAURENT,None,DR.,None,M.D.,17323 RED OAK DR,None,HOUSTON,TX,770901243.0

In [2]:
#filter hop_team for entity_type 1.0 or 2.0 and transaction_count>=50
#and average_day_wait<50 and taxonomy_switch = 'Y'
query = '''
WITH from_npi_list AS (
SELECT npi
FROM nppes
WHERE entity_type_code = 1.0
),
to_npi_list AS (
SELECT npi
FROM nppes
WHERE entity_type_code = 2.0
)
SELECT * 
FROM hop_team
WHERE from_npi IN from_npi_list 
AND to_npi IN to_npi_list
AND transaction_count >= 50 AND average_day_wait < 50

'''

with sqlite3.connect('data/hop_team.sqlite') as db:
    hop_team = pd.read_sql(query,db)
db.close()
hop_team.head()

,from_npi,to_npi,patient_count,transaction_count,average_day_wait,std_day_wait
0,1265564736,1003000209,22,148,0.000,0.000
1,1316131865,1003000217,47,52,27.212,50.908
2,1881710101,1003000217,185,227,0.000,0.000
3,1962528539,1003000217,308,412,0.000,0.000
4,1548451677,1003000274,64,76,35.803,42.841

In [4]:
query = '''SELECT * FROM cbsa WHERE cbsa = 34980'''
with sqlite3.connect('data/hop_team.sqlite') as db:
    nash_cbsa = pd.read_sql(query,db)
db.close()
nash_cbsa.head()

,zip,cbsa,usps_zip_pref_city,usps_zip_pref_state,res_ratio,bus_ratio,oth_ratio,tot_ratio
0,37190,34980,WOODBURY,TN,0.990999,0.991435,1.0,0.991154
1,37046,34980,COLLEGE GROVE,TN,0.992654,1.000000,1.0,0.992839
2,37077,34980,HENDERSONVILLE,TN,1.000000,1.000000,1.0,1.000000
3,37101,34980,MC EWEN,TN,0.002121,0.000000,0.0,0.002000
4,37026,34980,BRADYVILLE,TN,0.967974,1.000000,1.0,0.969112

In [5]:
query = '''
SELECT *
FROM cbsa
WHERE cbsa = 34980
OR cbsa = 17300 
OR cbsa = 14540 
OR cbsa = 27180 
OR cbsa = 18260 
OR cbsa = 30280 
OR cbsa = 43180 
OR cbsa = 46100 
OR cbsa = 32660 
OR cbsa = 16860
'''
with sqlite3.connect('data/hop_team.sqlite') as db:
    midTN_cbsa = pd.read_sql(query,db)
db.close()
midTN_cbsa.head()

,zip,cbsa,usps_zip_pref_city,usps_zip_pref_state,res_ratio,bus_ratio,oth_ratio,tot_ratio
0,37190,34980,WOODBURY,TN,0.990999,0.991435,1.0,0.991154
1,37190,32660,WOODBURY,TN,0.009001,0.008565,0.0,0.008846
2,38006,27180,BELLS,TN,0.876518,0.919463,1.0,0.879462
3,37338,16860,GRAYSVILLE,TN,0.312344,0.105263,0.0,0.305961
4,37414,16860,CHATTANOOGA,TN,1.000000,1.000000,1.0,1.000000

In [6]:
query = '''
SELECT code, classification, specialization, display_name
FROM nucc
'''
with sqlite3.connect('data/hop_team.sqlite') as db:
    nucc = pd.read_sql(query,db)
db.close()
nucc.head()

,code,classification,specialization,display_name
0,193200000X,Multi-Specialty,None,Multi-Specialty Group
1,193400000X,Single Specialty,None,Single Specialty Group
2,207K00000X,Allergy & Immunology,None,Allergy & Immunology Physician
3,207KA0200X,Allergy & Immunology,Allergy,Allergy Physician
4,207KI0005X,Allergy & Immunology,Clinical & Laboratory Immunology,Clinical & Laboratory Immunology (Allergy & Im...

In [8]:

query = '''
SELECT npi, taxonomy_code
FROM taxonomy
WHERE taxonomy_switch = 'Y'
'''
with sqlite3.connect('data/hop_team.sqlite') as db:
    taxonomy = pd.read_sql(query,db)
db.close()
taxonomy.head()

          NPI taxonomy_code
0  1679576722    207X00000X
1  1588667638    207RC0000X
2  1497758544    251G00000X
3  1023011178    251G00000X
4  1841293990    231H00000X

In [9]:
hop_team.shape

(9588564, 6)